{
  "profile": {
    "name": "Yustus Eko Oktian, Ph.D",
    "title": "Assistant Professor",
    "bio": "Yustus Eko Oktian, Ph.D is an Assistant Professor specializing in information security, blockchain technology, and software engineering. He has over 10 years of experience in academia and industry, with a passion for innovative research and quality education.",
    "academicBackground": [
      "PhD in Computer Engineering, Dongseo University, 2021.",
      "MSc in Computer Engineering, Dongseo University, 2016.",
      "ST in Electical Engineering, Petra Christian University, 2013."
    ],
    "office": {
      "department": "Department of Information Systems",
      "faculty": "School of Information Technology",
      "university": "Universitas Ciputra",
      "address": "CitraLand CBD Boulevard, Made, Kec. Sambikerep, Surabaya, Jawa Timur 60219, Indonesia"
    },
    "interests": "Information Security, Blockchain Technology, Software Engineering",
    "scopus": "https://www.scopus.com/authid/detail.uri?authorId=56465933800",
    "googleScholar": "https://scholar.google.com/citations?hl=en&user=3VLQx40AAAAJ",
    "sinta": "https://sinta.kemdikbud.go.id/authors/profile/6109507",
    "orcid": "https://orcid.org/0000-0002-3574-7820",
    "linkedin": "https://www.linkedin.com/in/yustus-eko-oktian-242023351/"
  },
  "projects": [
    {
      "title": "E-Governance Blockchain System",
      "description": "This research examines the inefficiencies in governmental systems caused by fragmented data and manual processes. It proposes the use of smart contracts as a unified, automated, and transparent mechanism for executing public sector functions. By embedding rules and workflows into code, smart contracts enable secure, verifiable, and auditable operations—offering a scalable solution for streamlining governance and enhancing accountability.",
      "year": "2024-Now"
    },
    {
      "title": "IoT Blockchain Security Framework",
      "description": "This research addresses the security vulnerabilities of Internet of Things (IoT) ecosystems by proposing blockchain-based solutions that align with the inherently decentralized nature of IoT networks. By leveraging decentralized ledger technologies, the study enhances trust, transparency, and resilience across IoT systems. It presents a comprehensive framework covering device authentication and authorization, secure software updates, data integrity assurance, and efficient data management. The research also evaluates and designs blockchain architectures optimized for IoT, aiming to ensure secure and scalable operations in distributed environments.",
      "year": "2020-Now"
    },
    {
      "title": "Secure and Fair AI Platform",
      "description": "This research aims to develop a secure and equitable Artificial Intelligence (AI) environment by addressing the limitations of traditional centralized AI architectures, where user data privacy is often compromised. By integrating Federated Learning and blockchain technology, the study proposes a decentralized AI framework that enhances data security, ensures user autonomy, and promotes fairness in model training and deployment. This approach enables collaborative model development without exposing raw user data, while leveraging blockchain to ensure transparency, auditability, and trust in the system.",
      "year": "2020-Now"
    },
    {
      "title": "Secure Software Define Network",
      "description": "This research focuses on the design and implementation of a secure Software-Defined Networking (SDN) framework aimed at enhancing network security within enterprise environments. The project spans multiple key areas, including the development of SDN security applications, the design of robust security protocols for both East-West and Northbound interfaces, and the creation of secure bandwidth trading and real-time pricing management applications. The framework is designed to address dynamic security challenges and promote adaptive, policy-driven control across network layers.",
      "year": "2014-2022"
    }
  ],
  "publications": [
    "Y. E. Oktian, K. P. Hilton, and Christian, \"Transforming Digital Identity through Smart Contract as Identity,\" in Proc. 2024 2nd Int. Conf. on Technology Innovation and Its Applications (ICTIIA), Medan, Indonesia, Sep. 2024, pp. 1–6.",
    "Y. E. Oktian, T.-T.-H. Le, U. Jo, A. M. A. Laksmono, and H. Kim, \"Secure decentralized firmware update delivery service for Internet of Things,\" Internet of Things, vol. 26, p. 101136, Jul. 2024.",
    "Y. E. Oktian, U. Jo, S. Oh, H. Jeong, J. Kim, T.-T.-H. Le, and H. Kim, \"Patchman: Firmware Update Delivery Service Over the Blockchain for IoT Environment,\" in Proc. Int. Conf. on Information Security Applications, Singapore: Springer Nature, Aug. 2023, pp. 131–142.",
    "Y. E. Oktian and S.-G. Lee, \"Blockchain-based federated learning system: A survey on design choices,\" Sensors, vol. 23, no. 12, p. 5658, Jun. 2023.",
    "Y. E. Oktian, T.-T.-H. Le, U. Jo, and H. Kim, \"Blockchain-powered bandwidth trading on SDN-enabled edge network,\" IEEE Access, vol. 10, pp. 114024–114039, Oct. 2022."
  ],
  "communityActivities": [
    "Reviewer for IEEE Access (2021)",
    "Reviewer for SN Applied Sciences (2021)"
  ],
  "contact": {
    "email": "yustus.oktian@ciputra.ac.id",
    "phone": "+6231-745-1699",
    "labs": "Data Science and Artificial Intelligence Research Center (DSAIRC)",
    "office_hours": "Monday - Friday, 8:00 AM - 4:00 PM (GMT+7)"
  },
  "courses": [
    {
      "name": "Web Design and Development",
      "semester": "Spring 2025",
      "description": "Comprehensive course on web design and development covering HTML, CSS, JavaScript, PHP, and the Laravel framework to build dynamic and responsive web applications.",
      "credits": 6
    },
    {
      "name": "Business Data Communication",
      "semester": "Spring 2025",
      "description": "A foundational course in computer networking that explores the OSI model, network protocols, and hands-on configuration using Cisco Packet Tracer and MikroTik routers.",
      "credits": 3
    },
    {
      "name": "Microservices Development",
      "semester": "Spring 2025",
      "description": "A practical course on microservices architecture focusing on virtualization and containerization using Virtual Machines, Vagrant, Docker Desktop, and Docker Swarm for scalable application deployment.",
      "credits": 3
    },
    {
      "name": "Cyber Security",
      "semester": "Spring 2025",
      "description": "A comprehensive course on cybersecurity covering IT threats and vulnerabilities, cryptographic principles, AAA (Authentication, Authorization, Accounting), and ethical hacking techniques to secure digital systems.",
      "credits": 4
    }
  ],
  "awards": [
    {
      "title": "Best Lecture in Teaching-Learning Innovation",
      "organization": "Ciputra University",
      "year": "2024"
    },
    {
      "title": "Best Paper Award",
      "organization": "International Conference on Platform Technology and Service",
      "year": "2022"
    },
    {
      "title": "Outstanding Reviewer Award",
      "organization": "MDPI Journal - Future Internet",
      "year": "2022"
    }
  ]
}
